Revit 2024 API
ImageBackgroundSettings Properties
The ImageBackgroundSettings type exposes the following members.
Properties
Name | Description
BackgroundImageFit
 The background image fit type.
FilePath
 File path of the image for the rendering background.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from BackgroundSettings.)
OffsetHeight
 The vertical offset of the rendering image to the rendering region.
OffsetWidth
 The horizontal offset of the rendering image to the rendering region.
See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace